module.exports = {
  BOOK_LOADER: 'записываем... пожалуйста, подожди!',
  REPEATED_COMMAND: 'эту книгу мы уже записали!',
  BOOK_BORROWED: 'привет, записали! не забудь вернуть книгу до ',
  BOOK_BORROWED_ENDING: '\n\nприятного чтения 🐌',
  WRONG_COMMAND: 'такой команды не существует',
  HELP_COMMAND: 'если у тебя iPhone, пожалуйста, закрой чат с ботом перед тем, как отсканировать qr-код на обложке. есть баги, которые нам не поправить🤖\n\nнаписать человеку: @shellllllf 🤖',
  EMPTY_START_COMMAND: 'привет! чтобы взять книгу, отсканируй qr-код с обложки',
  CHOOSE_BOOK: 'выбери книгу, которую хочешь вернуть:',
  BOOK_RETURNED: 'спасибо, что вернул:а книгу на полку!',

  SUPPORT: 'кажется, что-то пошло не так. напиши, пожалуйста, в поддержку: @shellllllf 🤖',
  NO_BOOK_TO_RETURN: 'кажется, ты ещё не взял:а ни одной книги. если это не так, напиши, пожалуйста, в поддержку: @shellllllf 🤖',

  ADMIN_ERROR: 'bot\n\nчто-то пошло не так у пользователя:\n',

  REMINDER: 'привет! не забудь вернуть книгу до ',
  REMINDER_ENDING: '\n\nдругие читател:ьницы уже ее заждались, а для тебя на наших полках, возможно, появилось что-то новое интересное 🐌',
  HOW_TO_RETURN: 'поставь книгу на полку shell(f), а потом нажми кнопку «вернуть книгу» из меню 🤝',

  DONATE: 'поддержать работу библиотеки донейшеном:\n\n'
};
