module.exports = {
  BOOK_BORROWED: 'привет, записали! не забудь вернуть книгу до ',
  BOOK_BORROWED_ENDING: '\n\nприятного чтения 🐌',
  WRONG_COMMAND: 'такой команды не существует',
  CHOOSE_BOOK: 'выбери книгу, которую хочешь вернуть:',
  BOOK_RETURNED: 'спасибо, что вернул:а книгу на полку!',

  SUPPORT: 'кажется, что-то пошло не так. напиши, пожалуйста, в поддержку: @shellllllf 🤖',
  NO_BOOK_TO_RETURN: 'кажется, ты ещё не взял:а ни одной книги. если это не так, напиши, пожалуйста, в поддержку: @shellllllf 🤖',

  ADMIN_ERROR: 'bot: что-то пошло не так у пользователя ',

  REMINDER: 'привет! пора возвращать книгу:\n\n',
  REMINDER_ENDING: '\n\nдругие читател:ьницы уже ее заждались, а для тебя на наших полках, возможно, появилось что-то новое интересное 🐌',
};
